class A {
  int a;
  int b;
  int c;
  int z;

  public A() {
    this(1); // Теперь вызываем конструктор с одним параметром
  }

  public A(int a) {
    this(a, 0); // Вызываем конструктор с двумя параметрами (b задан как 0)
  }

  public A(int a, int b) {
    this(a, b, 0); // Вызываем конструктор с тремя параметрами (c задан как 0)
  }

  public A(int a, int b, int c) {
    this.a = a;
    this.b = b;
    this.c = c;
    z = 1; // Эта операция может остаться в конце, так как она не относится к вызову других конструкторов
  }
}
